[TIMER] Process Time: 12:51:35
[INFO] GPU not detected.
[INFO] Done importing packages.
[INFO] Loading Training and Test Datasets.
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 64, 64, 6)         2184      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 32, 32, 6)         0         
_________________________________________________________________
dropout (Dropout)            (None, 32, 32, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 30, 12)        660       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 12)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 10, 12)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 24)          2616      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 24)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4, 4, 24)          0         
_________________________________________________________________
flatten (Flatten)            (None, 384)               0         
_________________________________________________________________
dense (Dense)                (None, 96)                36960     
_________________________________________________________________
dense_1 (Dense)              (None, 24)                2328      
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 50        
=================================================================
Total params: 44,798
Trainable params: 44,798
Non-trainable params: 0
_________________________________________________________________
